app/views/students/edit.html.erb

              </tr>
              <% @student.course_histories.all.each do |course| %>
---
SELECT "course_histories".* FROM "course_histories" WHERE "course_histories"."student_id" = ?  [["student_id", 30]]