app/views/documents/create.js.erb

} else {
  <% html = "<tr class='ctable'> <td class='ctable'><a target='_blank' href='#{asset_path(@document.location)}'> #{@document.title} </a>  </td><td class=\"ctable\"><a> #{@document.updated_at} </a> </td>  <td class='ctable touch'>#{link_to 'Delete', @document, method: :delete, data: { remote: 'true', format: 'js' }}</td> </tr>" %>
---
UPDATE "documents" SET "updated_at" = ? WHERE "documents"."id" = ?  [["updated_at", 2016-11-20 16:02:04 UTC], ["id", 2]]