app/controllers/course_histories_controller.rb

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
---
  def create
    # puts "in Search!"
    #
    allow_admin
    @semesterError = false
    @courseError = false

    respond_to do |format|

      #raise params[:course_history][:student_id].inspect

      @student = Student.find(params[:course_history][:student_id])

SELECT  "course_histories".* FROM "course_histories" WHERE "course_histories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def search_and_destroy
    @course_history = CourseHistory.find(course_history_params[:id])