app/controllers/course_descriptions_controller.rb

SELECT "course_descriptions".* FROM "course_descriptions"
---
  def index
    @course_descriptions = CourseDescription.all

SELECT  "course_descriptions".* FROM "course_descriptions" WHERE "course_descriptions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
SELECT  "course_descriptions".* FROM "course_descriptions" WHERE "course_descriptions"."number" = ? ORDER BY "course_descriptions"."id" ASC LIMIT ?  [["number", 55], ["LIMIT", 1]]
SELECT  "semesters".* FROM "semesters" WHERE "semesters"."semester" = ? AND "semesters"."year" = ? AND "semesters"."course_description_id" = ? ORDER BY "semesters"."id" ASC LIMIT ?  [["semester", "Fall"], ["year", 2006], ["course_description_id", 4], ["LIMIT", 1]]
---
  def search
    # puts "in Search!"
    #

    @semesterError = false
    @courseError = false

    respond_to do |format|

    @student = Student.find(params[:course_description][:student])

    #diane's way


    @course = CourseDescription.where({number: params[:course_description][:number]}).first


    if !@course
      @courseError = true
      puts "Course ERRROR"
      format.js {}
      return
    end

    #raise @course.inspect

    @semester = Semester.where(course_description_params.slice(:semester, :year).merge({course_description_id: @course.id})).first

INSERT INTO "course_descriptions" ("number", "name", "category", "hours", "created_at", "updated_at", "department") VALUES (?, ?, ?, ?, ?, ?, ?)  [["number", 512], ["name", "adsa"], ["category", "Applications"], ["hours", "1"], ["created_at", 2016-11-21 03:06:44 UTC], ["updated_at", 2016-11-21 03:06:44 UTC], ["department", "COMP"]]
INSERT INTO "semesters" ("course_description_id", "faculty_id", "year", "semester", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_description_id", 3], ["faculty_id", 1], ["year", 2006], ["semester", "Fall"], ["created_at", 2016-11-18 17:42:21 UTC], ["updated_at", 2016-11-18 17:42:21 UTC]]
SELECT "faculties"."id" FROM "faculties" WHERE "faculties"."firstName" = ? AND "faculties"."lastName" = ?  [["firstName", "Star"], ["lastName", "Bucks"]]
---
  def create

    #raise course_description_params.except(:teacher, :year, :semester).inspect

    respond_to do |format|

      @facultyError = false
      @numberError = false
      @nameError = false


      if(course_description_params[:name] == "")
        @nameError = true
        format.js {}
        return
      end

      if(course_description_params[:number] == "")
        @numberError = true
        format.js {}
        return
      end

    @course_description = CourseDescription.find_or_create_by(course_description_params.except(:teacher, :year, :semester))

    name = course_description_params[:teacher].split(", ")

    faculty = Faculty.where({firstName: name[1], lastName: name[0]}).pluck(:id).first

DELETE FROM "course_descriptions" WHERE "course_descriptions"."id" = ?  [["id", 2]]
---
  def destroy
    @course_description.destroy

SELECT "course_descriptions"."name", "course_descriptions"."number" FROM "course_descriptions" WHERE (number LIKE '%5%')
---
  def typeahead
    if params[:id] == "suggestions"  # Typeahead Prefetch default returns nothing. Prevents bug on page load.
      return
    end


    if search_params[:query].to_i.to_s == search_params[:query]
      puts "is true"
      @suggestions = CourseDescription.where('number LIKE ?', "%#{search_params[:query]}%").pluck(:name,:number).map{ |s| {name: s[0], number: s[1]}}

SELECT  "course_descriptions".* FROM "course_descriptions" WHERE "course_descriptions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_course_description
      @course_description = CourseDescription.find(params[:id])