app/controllers/course_descriptions_controller.rb

  def search
    puts "in Search!"

    @student = Student.find(params[:course_description][:student]);

    param_hash = {}
    param_hash[:number] = params[:course_description][:number] if params[:course_description][:number].present?
    param_hash[:name] = params[:course_description][:name] if params[:course_description][:name].present?
    param_hash[:teacher] = params[:course_description][:teacher] if params[:course_description][:teacher].present?
    param_hash[:section] = params[:course_description][:section] if params[:course_description][:section].present?
    param_hash[:category] = params[:course_description][:category] if params[:course_description][:category].present?
    param_hash[:semester] = params[:course_description][:semester] if params[:course_description][:semester].present?
    param_hash[:hours] = params[:course_description][:hours] if params[:course_description][:hours].present?
    #param_hash = param_hash.to_query

    puts param_hash.inspect

    @results = CourseDescription.where(param_hash);

    puts @results.size
---
SELECT "course_descriptions".* FROM "course_descriptions"
SELECT "course_descriptions"."id" FROM "course_descriptions" WHERE "course_descriptions"."name" = ?  [["name", "Algorithms"]]
SELECT COUNT(*) FROM "course_descriptions"

  def update
    respond_to do |format|
      if @course_description.update(course_description_params)
---
UPDATE "course_descriptions" SET "number" = ?, "name" = ?, "updated_at" = ? WHERE "course_descriptions"."id" = ?  [["number", 220], ["name", "ACM"], ["updated_at", 2016-11-14 01:25:24 UTC], ["id", 7]]