app/controllers/documents_controller.rb

  def create

    @pdfError = false
    @selectError = false
    @warning = false;

    respond_to do |format|

      @document = Document.new(document_params)

      #raise @document.inspect

      uploaded_io = params[:document][:location]
      uploaded_io.original_filename = document_params[:title].to_s + ".pdf"

      studentName = Student.find(params[:document][:student_id]).lastName
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]




      if @document.save
---
INSERT INTO "documents" ("title", "location", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
UPDATE "documents" SET "updated_at" = ? WHERE "documents"."id" = ?  [["updated_at", 2016-11-20 16:02:04 UTC], ["id", 2]]

  def destroy
    puts Rails.public_path + @document.location
    FileUtils.rm(Rails.public_path + @document.location)
    @document.destroy
---
DELETE FROM "documents" WHERE "documents"."id" = ?  [["id", 5]]