app/controllers/faculties_controller.rb

  def index
    if(session[:admin])
      puts session[:admin]
      puts session[:faculty]
      puts session[:student_id]
    else
      raise "no access".inspect
    end

    @faculties = Faculty.all
---
SELECT "faculties".* FROM "faculties"

  def create

    if(session[:admin])
      puts session[:admin]
      puts session[:faculty]
      puts session[:student_id]
    else
      raise "no access".inspect
    end

    @faculty = Faculty.new(faculty_params)

    respond_to do |format|
      if @faculty.save
---
INSERT INTO "faculties" ("firstName", "lastName", "sectionNumber", "PID", "isAdmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["firstName", "Diane"], ["lastName", "Pozefsky"], ["sectionNumber", ""], ["PID", ""], ["isAdmin", "no"], ["created_at", 2016-11-14 17:39:04 UTC], ["updated_at", 2016-11-14 17:39:04 UTC]]

  def typeahead

    if params[:id] == "suggestions"  # Typeahead Prefetch default returns nothing. Prevents bug on page load.
      return
    end
    #@suggestions = CourseDescription.where("name LIKE" => "%#{search_params[:query]}%")
    @suggestions = Faculty.where('lastName LIKE ?', "%#{search_params[:query]}%").pluck(:lastName, :firstName).map{ |s| s[0] + ", " + s[1] } #Select the data you want to load on the typeahead.
    #@suggestions.map{ |s| {name: s[0], number: s[1], hours: s[2]}}
---
SELECT "faculties"."lastName", "faculties"."firstName" FROM "faculties" WHERE (lastName LIKE '%P%')

    def set_faculty
      @faculty = Faculty.find(params[:id])
---
SELECT  "faculties".* FROM "faculties" WHERE "faculties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]