app/controllers/students_controller.rb

  def show
    @doc_titles = Document.where({:student_id => params[:id]}).pluck(:title)
    @student = Student.find(params[:id])
    @job = Job.new(student: @student)
    @document = Document.new(student: @student)
    @course_description = CourseDescription.new
    @course_description.student = @student.id
    @course_histories = CourseHistory.where(student_id: @student.id)
---
SELECT "documents"."title" FROM "documents" WHERE "documents"."student_id" = ?  [["student_id", 1]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
SELECT "course_histories".* FROM "course_histories" WHERE "course_histories"."student_id" = ?  [["student_id", 8]]

  def edit
    @doc_titles = Document.where({:student_id => params[:id]}).pluck(:title)
    @student = Student.find(params[:id])

    @student.startedSemester = @student.semesterStartedCS.split(" ")[0]
    @student.startedYear = @student.semesterStartedCS.split(" ")[1]

    @student.approvedSemester = @student.backgroundApproved.split(" ")[0]
    @student.approvedYear = @student.backgroundApproved.split(" ")[1]

    @job = Job.new(student: @student)
    @document = Document.new(student: @student)
    @course_description = CourseDescription.new
    @course_description.student = @student.id
    @course_histories = CourseHistory.where(student_id: @student.id)
---
SELECT "documents"."title" FROM "documents" WHERE "documents"."student_id" = ?  [["student_id", 2]]
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "course_histories".* FROM "course_histories" WHERE "course_histories"."student_id" = ?  [["student_id", 2]]
SELECT SUM(hours) FROM "course_histories" WHERE "course_histories"."student_id" = ?  [["student_id", 1]]

        return
      end

      if @student.save
---
INSERT INTO "students" ("firstName", "lastName", "PID", "alternativeName", "gender", "ethnicity", "status", "citizenship", "residency", "enteringStatus", "advisor", "researchArea", "semesterStartedCS", "backgroundApproved", "leaveExtension", "fundingEligibility", "intendedDegree", "created_at", "updated_at", "PRP", "oralExam", "committeeMeeting", "ABD", "dissertation_defense", "finalDiss", "phdAdmitDate") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def upload_photo

    @student = Student.find(student_params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]

    #raise new_params.inspect

    respond_to do |format|
      if @student.update(new_params)
---
UPDATE "students" SET "imageLocation" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["imageLocation", "uploads/720131845/Fred-Brooks (1).jpg"], ["updated_at", 2016-11-14 00:17:32 UTC], ["id", 33]]

  def update
    @student.semesterStartedCS = student_params[:startedSemester] + " "  + student_params[:startedYear]
    @student.backgroundApproved = student_params[:approvedSemester] + " "  + student_params[:approvedYear]

    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "PRP" = ?, "oralExam" = ?, "committeeMeeting" = ?, "ABD" = ?, "dissertation_defense" = ?, "finalDiss" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["PRP", "Yes"], ["oralExam", "No"], ["committeeMeeting", "Yes"], ["ABD", "No"], ["dissertation_defense", "No"], ["finalDiss", "No"], ["updated_at", 2016-11-20 20:16:00 UTC], ["id", 1]]